/*==============================================*\ 
 | 最大公约数-辗转相除 
\*==============================================*/  
int gcd(int a,int b){  
    if (b==0) return a;  
    return gcd(b,a%b);  
}  
/*==============================================*\ 
 | 扩展欧几里得 
 | ax+by=gcd(a,b) 
\*==============================================*/  
int extgcd(int a,int b,int& x,int& y){  
    int d=a;  
    if (b!=0){  
        d=extgcd(b,a%b,y,x);  
        y-=(a/b)*x;  
    }else{  
        x=1;y=0;  
    }  
    return d;  
}  
